---
title: MEPSize
classe: Autodesk.Revit.DB.MEPSize
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 7
---

# MEPSize

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Double InnerDiameter { get; }` | `mEPSize.InnerDiameter` | Double |
| `Boolean IsValidObject { get; }` | `mEPSize.IsValidObject` | Boolean |
| `Double NominalDiameter { get; }` | `mEPSize.NominalDiameter` | Double |
| `Double OuterDiameter { get; }` | `mEPSize.OuterDiameter` | Double |
| `Boolean UsedInSizeLists { get; }` | `mEPSize.UsedInSizeLists` | Boolean |
| `Boolean UsedInSizing { get; }` | `mEPSize.UsedInSizing` | Boolean |
| `Void Dispose()` | `mEPSize.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```